# GetTemperature Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CorrectionFactor..::..GetTemperature Method
CorrectionFactor Class See Also
---
Get temperature which is used for specifying correction factor. The value returned is quantified in the document's selected unit of electrical temperature.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double GetTemperature()
```

Visual Basic
---
```text
Public Function GetTemperature As Double
```

Visual C++
---
```text
public:
double GetTemperature()
```

# See Also
CorrectionFactor Class
Autodesk.Revit.DB.Electrical Namespace